Repository: pypi-data/pypi-mirror-365
Catalog: packages/pretix-pix-manual/pretix_pix_manual-0.1.0.tar.gz/pretix_pix_manual-0.1.0/pretix_pix_manual/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Brazilian Pix - Manual processing
pt_br: Pix - Processamento manual

source: Pix key
pt_br: Chave Pix

source: Pix key that will be used to receive payments. It can be an email address, phone number, CNPJ, CPF, or a random key generated by your bank.
pt_br: Chave Pix que será utilizada para receber pagamentos. Pode ser um endereço de e-mail, um CNPJ, um CPF ou uma chave aleatória gerada pelo seu banco.

source: Proof of payment e-mail
pt_br: E-mail para recebimento do comprovante de pagamento

source: Email address that customers should use to send proof of payment
pt_br: Endereço de e-mail que os clientes deverão usar para enviar o comprovante de pagamento

source: Merchant city
pt_br: Cidade do recebedor

source: City of payment beneficiary.
pt_br: Cidade do beneficiário do pagamento.

source: Merchant name
pt_br: Nome do recebedor

source: Name of payment beneficiary
pt_br: Nome do beneficiário do pagamento

source: Please provide a valid Pix key.
pt_br: Por favor, forneça uma chave Pix válida.

source: This payment method will generate a Pix code with order information that your customer can use to make the payment. Payment confirmation, cancellations, and refunds must be done manually.
pt_br: Este método de pagamento irá gerar um código Pix com informações do pedido que seu cliente poderá utilizar para efetuar o pagamento. A confirmação do pagamento, cancelamentos e reembolsos deverão ser processados manualmente.

source: In test mode, you can just manually mark this order as paid in the backend after it has been created.
pt_br: No modo de teste, você pode simplesmente marcar manualmente esse pedido como pago no backend depois de criado.

source: To make the payment, copy and paste the following Pix code into your banking app. {pix_code} After making payment, send proof of payment to {proof_of_payment_email}, including your order code {payment.order.code} in the subject line.
pt_br: Para efetuar o pagamento, copie e cole o seguinte cõdigo Pix no seu aplicativo bancário. {pix_code} Após efetuar o pagamento, envie o comprovante para {proof_of_payment_email}, incluindo o seu códigodo pedido {payment.order.code} no campo de assunto.

source: After completing your purchase, we will provide you with a <strong>Pix code</strong> that you must use to pay for your order.
pt_br: Após completar a sua compra, iremos te fornecer um <strong>código Pix</strong> que você deverá utilizar para efetuar o pagamento do seu pedido.

source: Your order has been successfully received. Make the payment via Pix by scanning the QR Code below or copy and paste the following code into your banking app.
pt_br: Seu pedido foi recebido com sucesso. Efetue o pagamento via Pix escaneando o QR Code abaixo ou copiando e colando o código a seguir em seu aplicativo bancário.

source: After making payment, send proof of payment to <strong>%(proof_of_payment_email)s</strong>, including your order code <strong>%(order_code)s</strong> in the subject line.
pt_br: Após efetuar o pagamento, envie o comprovante para <strong>%(proof_of_payment_email)s</strong> incluindo o seu código do pedido <strong>%(order_code)s</strong> no campo de assunto.

source: <strong>IMPORTANT: Payment confirmation is handled manually by the event organizers. Therefore, if you do not send proof of payment, your order will remain pending payment, preventing you from checking in.</strong>
pt_br: <strong>IMPORTANTE: A confirmação de pagamento é processada manualmente pela equipe de organização do evento. Deste modo, se você não enviar o comprovante de pagamento, o seu pedido permanecerá pendente de pagamentos impedindo que você realize check-in.</strong>

source: If you have any questions regarding your order, please contact the event organizers
pt_br: Se você tiver qualquer dúvida relacionado ao seu pedido, entre em contato com a equipe de organização do evento

source: at <strong>%(contact_mail)s</strong>
pt_br: em <strong>%(contact_mail)s</strong>
