Repository: pypi-data/pypi-mirror-365
Catalog: packages/diacamma-financial/diacamma_financial-2.7.5.25070909-py3-none-any.whl/diacamma/payoff/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Diacamma payoff
fr: Règlement Diacamma

source: Email sended at %s
fr: Courriel envoyé le %s

source: payoff null!
fr: règlement vide !

source: linked
fr: associé

source: No-valid selection!
fr: Sélection non valide!

source: repartition mode
fr: répartition proportionnelle

source: third
fr: tiers

source: is revenu
fr: est un revenu

source: total payed
fr: total payé

source: rest to pay
fr: restant dû

source: supporting
fr: support

source: no third selected
fr: aucun tiers sélectionné

source: third has not correct account
fr: le tiers n'a pas de compte d'ouvert

source: date not include in current fiscal year
fr: la date n'est pas incluse dans l'exercice courant

source: date not include in a valid fiscal year
fr: la date n'est pas incluse dans un exercice valide

source: saved PDF report not found !
fr: rapport PDF non trouvé !

source: designation
fr: désignation

source: reference
fr: référence

source: bank account
fr: compte bancaire

source: order key
fr: ordre

source: is disabled
fr: désactivé

source: bank journal
fr: journal de banque

source: temporary account
fr: compte d'attente

source: temporary journal
fr: journal d’attente

source: fee account
fr: imputation des frais

source: bank code
fr: code bancaires

source: bank codes
fr: codes bancaires

source: cash
fr: espèces

source: cheque
fr: chèque

source: transfer
fr: virement

source: credit card
fr: carte de crédit

source: other
fr: autre

source: levy
fr: prélèvement

source: internal
fr: interne

source: by ratio
fr: par prorata

source: by date
fr: sur dette la plus ancienne

source: amount
fr: montant

source: payer
fr: payeur

source: entry
fr: écriture

source: bank fee
fr: frais bancaires

source: linked payoff
fr: élément associé

source: %(bank)s (fee = %(fee)s)
fr: %(bank)s (frais = %(fee)s)

source: an entry associated to this payoff is closed!
fr: une écriture associée à ce règlement est clôturée !

source: payoff for %s
fr: règlement de %s

source: account is not defined!
fr: le compte n'est pas défini !

source: payoff for %d multi-pay
fr: règlement de %d factures

source: bill type different !
fr: type de justificatifs différents !

source: payoff
fr: règlement

source: payoffs
fr: règlements

source: building deposit
fr: en création

source: closed deposit
fr: clôturé

source: valid deposit
fr: validé

source: status
fr: statut

source: number
fr: nombre

source: Remove of %s impossible!
fr: Supression de %s impossible !

source: To Close
fr: Clôturer

source: Validate
fr: Valider

source: Deposit slip '%s' validate
fr: Bordereau de chèques N°%s

source: deposit slip
fr: remise de chèques

source: deposit slips
fr: remises de chèques

source: deposit
fr: remise

source: link document
fr: document associé

source: deposit detail
fr: détail de la remise

source: deposit details
fr: détails

source: parameters
fr: paramètres

source: payment method
fr: moyen de paiement

source: payment methods
fr: moyens de paiement

source: failure
fr: échec

source: success
fr: succès

source: contains
fr: contenu

source: bank transaction
fr: transaction bancaire

source: bank transactions
fr: transactions bancaires

source: payoff-cash-account
fr: compte de caisse

source: payoff-email-message
fr: message de courriel par défaut

source: #name{[br/]}{[br/]}Joint in this email #doc.{[br/]}{[br/]}Regards
fr: #name{[br/]}{[br/]}Veuillez trouver joint à ce courriel #doc.{[br/]}{[br/]}Sincères salutations

source: payoff-email-subject
fr: sujet de courriel par défaut

source: payoff-mode
fr: règlement > mode

source: payoff-bank_account
fr: règlement > compte bancaire

source: Payement methods
fr: Moyens de paiement

source: Payment
fr: Paiement

source: Please wait, you will be logged into the payment platform.
fr: Patienter s'il vous plaît, vous allez être connecté à la plateforme de règlement.

source: Reference to remind
fr: référence à rappeler

source: payable to
fr: à l'ordre de

source: address
fr: adresse

source: help_payoff_paypal
fr: Veuillez préciser l'adresse courriel associé à votre compte PayPal.

source: Paypal account
fr: compte Paypal

source: With control
fr: avec contrôle

source: This item can't be validated!
fr: Cet élément n'est pas validable !

source: online
fr: en ligne

source: help_payoff_online
fr: Indiquez le lien internet vers votre site de règlement.

source: web address
fr: adresse web

source: info
fr: information

source: help_payoff_moneticopaiement
fr: Veuillez prendre contact avec votre agence bancaire pour faire ouvrir votre accès et obtenir les 3 champs à remplir.{[br/]} De plus, vous devez déclarer à la plateforme cet adresse de retour {[b]}%s/diacamma.payoff/validationPaymentMoneticoPaiement{[/b]} pour que l'outil soit notifié des paiements.

source: companie code
fr: code d'entreprise

source: TPE
fr: code TPE

source: key
fr: clef de sécuritée

source: help_payoff_helloasso
fr: Depuis le portail Hello-Asso, dans le menu "Mon compte > Intégration et API".{[br/]} - Recopiez ici le {[b]}mon clientid{[/b]} et le {[b]}mon clientsecret{[/b]}.{[br/]} - Remplissez le champ {[b]}Mon URL de callback{[/b]} par l'adresse {[b]}%s/diacamma.payoff/validationPaymentHelloAsso{[/b]} pour que l'outil soit notifié des paiements.

source: clientid
fr: Mon clientId

source: clientsecret
fr: Mon clientSecret

source: Add payoff
fr: Ajouter un règlement

source: Modify payoff
fr: Modifier un règlement

source: Internal payoff not editable !
fr: Ce règlement interne n'est pas éditable !

source: Delete payoff
fr: Supprimer un règlement

source: change
fr: changer

source: Select third
fr: Sélection d'un tiers

source: Filtrer by contact
fr: Filtrer sur contact

source: select
fr: sélectionner

source: Send
fr: Envoyer

source: Send by email
fr: Envoyer par courriel

source: No send item !
fr: Élément non envoyé !

source: nb of sending
fr: nombre à envoyer

source: subject
fr: sujet

source: Get saved report
fr: Obtenir le rapport sauvegardé

source: No payment for this document.
fr: Pas de paiement pour ce document

source: Management of parameters and configuration of payoff
fr: Modes de paiements et paramètres

source: Payoff configuration
fr: Configuration des règlements

source: Bank code
fr: Code bancaire

source: show only enabled bank account
fr: afficher seulement les comptes bancaires actifs

source: Payment method
fr: Moyens de paiement

source: Parameters
fr: Paramètres

source: Add bank code
fr: Ajouter un code bancaire

source: Modify bank code
fr: Modifier un code bancaire

source: Delete bank code
fr: Supprimer un code bancaire

source: Up
fr: Monter

source: Up bank code
fr: Monter un code bancaire

source: Add payment method
fr: Ajouter un moyen de paiement

source: Modify payment method
fr: Modifier un moyen de paiement

source: Delete payment method
fr: Supprimer un moyen de paiement

source: Payoff
fr: Règlement

source: Configuration of payoff parameters
fr: Definissez vos paramètrages de règlement

source: Bank account
fr: Comptes bancaires

source: Configuration of bank account
fr: Ajoutez vos comptes bancaires.{[br/]}Ils apparaitront dans la liste de vos établissements financiers.

source: Configuration of payment method
fr: Ajoutez vos moyens de paiement.{[br/]}Ces choix seront proposés à vos utilisateurs pour un règlement à distance.

source: Manage deposit of cheque
fr: Gestion des remises de chèques

source: Deposit slips
fr: Remises de chèques

source: Filter by status
fr: Filtrer sur le statut

source: Filter by year
fr: Filtrer sur l'exercice comptable

source: payoff by cheque
fr: Les règlements par chèque

source: payer contains
fr: nom payeur contient

source: reference contains
fr: référence contient

source: date superior to
fr: date supérieure à

source: date inferior to
fr: date inférieure à

source: without deposit
fr: sans remise de chèques

source: Add deposit slip
fr: Ajouter une remise de chèques

source: Modify deposit slip
fr: Modifier une remise de chèques

source: Show deposit slip
fr: Voir une remise de chèques

source: show link document
fr: voir les documents associés

source: Delete deposit slip
fr: Supprimer une remise de chèques

source: Deposit slip
fr: Bordereau de remise de chèques

source: *** NO VALIDATED ***
fr: *** NON VALIDÉ ***

source: Add deposit detail
fr: Ajouter un détail

source: select cheque to deposit
fr: sélectionnez les créances liées aux chèques à déposer

source: Save deposit detail
fr: Sauver le détail

source: Delete deposit detail
fr: Supprimer un détail

source: show bank transactions
fr: voir les transactions bancaires

source: Bank transactions
fr: Transactions bancaires

source: Show bank transaction
fr: Voir une transaction bancaire

source: It is not possible to pay-off this item with %s !
fr: Il n'est pas possible de régler cet élément avec %s !

source: This item is deleted, payed or disabled.
fr: Cet élément est supprimé, réglé ou désactivé.

source: Payment failure
fr: Échec de paiement

source: <html> An online payment request was received in error in <i>Diacamma</i>.<br/> <ul> <li><u>Mode:</u> %(mode)s</li> <li><u>Document:</u> %(doc)s</li> <li><u>Date:</u> %(date)s</li> <li><u>Amount:</u> %(amount)s</li> <li><u>Payer:</u> %(payer)s</li> <ul> <br/> %(current_name)s<br/> </html>
fr: <html> Une demande de payement en ligne a été reçu avec erreur dans <i>Diacamma</i>.<br/> <ul> <li><u>Mode:</u> %(mode)s</li> <li><u>Document:</u> %(doc)s</li> <li><u>Date:</u> %(date)s</li> <li><u>Montant:</u> %(amount)s</li> <li><u>Payeur:</u> %(payer)s</li> <ul> <br/> %(current_name)s<br/> </html>

source: Payoff terminate.
fr: Paiement terminé.

source: Thanks you.
fr: Merci de votre visite.

source: Payoff aborded.
fr: Paiement annulé ou invalide !
