Repository: pypi-data/pypi-mirror-365
Catalog: packages/diacamma-financial/diacamma_financial-2.7.5.25070909-py3-none-any.whl/diacamma/accounting/system/locale/*/LC_MESSAGES/django.po
Languages: fr

source: French system acounting
fr: Plan comptable générale Français

source: Belgium system acounting
fr: Plan comptable Belge

source: Fiscal year closing - Result
fr: Cloture d'exercice - Résultat

source: Fiscal year closing - Third
fr: Cloture d'exercice - Tiers

source: profit
fr: bénéfice

source: deficit
fr: déficite

source: Profit and deficit
fr: Bénéfices et Pertes

source: {[i]}You have a %(type)s of %(value)s.{[br/]}You must to define the account to affect.{[br/]}{[/i]}
fr: {[i]}Vous avez un %(type)s de %(value)s.{[br/]}Vous devez definir sur quel compte l'affecter.{[br/]}{[/i]}

source: {[br/]}After validation, you begin '%s'.{[br/]}{[br/]}{[i]}{[u]}Warning:{[/u]} Your retained earnings must be completed.{[/i]}
fr: {[br/]}En validant, vous commencerez '%s'{[br/]}{[br/]}{[i]}{[u]}Attention:{[/u]} Votre report à nouveau doit être totalement fait.{[/i]}

source: Affect of profit/deficit
fr: Affectation des bénéfices/pertes

source: Do you want to begin '%s'? {[br/]}{[br/]}{[i]}{[u]}Warning:{[/u]} Your retained earnings must be completed.{[/i]}
fr: Voulez-vous commencer '%s'? {[br/]}{[br/]}{[i]}{[u]}Attention:{[/u]} Votre report à nouveau doit être totalement fait.{[/i]}

source: Retained earnings - Balance sheet
fr: Report à nouveau - Bilan

source: Retained earnings - Third party debt
fr: Report à nouveau - Dette tiers

source: Link problem for: {[br]} - %s{[br]}
fr: Problème de lettrage pour: {[br]} - %s{[br]}

source: immobilizations & stock
fr: immobilisatons & stock

source: Sub-total
fr: Sous-total

source: receivables
fr: créances

source: values & availabilities
fr: Valeurs et disponibilités

source: liabilities
fr: dettes

source: result (deficit)
fr: résultat (déficit)

source: result (profit)
fr: résultat (bénéfice)
